### Data Frame - Input and Output files 
[Keyboard Shortcuts for Jupyter](https://www.dataquest.io/blog/jupyter-notebook-tips-tricks-shortcuts)

[Pandaas Basic Operations](https://www.shanelynn.ie/using-pandas-dataframe-creating-editing-viewing-data-in-python/)

In [2]:
import pandas as pd
import numpy as npb

### Fetch Data from URL

In [23]:
import urllib

In [24]:
myurl = "http://aima.cs.berkeley.edu/data/iris.csv"

In [25]:
urlrequest = urllib.request.Request(myurl)

In [39]:
urlopen = urllib.request.urlopen(urlrequest)

In [40]:
irisFile = pd.read_csv(urlopen,sep=',',header=None,decimal='.',names =['sepal_length','sepal_width','petal-length','petal width','target'])

In [42]:
irisFile.head(5) #first 5 Records

   sepal_length  sepal_width  petal-length  petal width  target
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [43]:
irisFile.tail(5) # Last 5 records

     sepal_length  sepal_width  petal-length  petal width     target
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

* For numeric columns, describe() returns basic statistics: the value count, mean, standard deviation, minimum, maximum, and 25th, 50th, and 75th quantiles for the data in a column.

* For string columns, describe() returns the value count, the number of unique entries, the most frequently occurring value (‘top’), and the number of times the top value occurs (‘freq’)

In [44]:
irisFile.dtypes # dtypes gives different types of the data types in pandas data frame

sepal_length    float64
sepal_width     float64
petal-length    float64
petal width     float64
target           object
dtype: object

In [48]:
irisFile['sepal_length'].describe()

count    150.000000
mean       5.843333
std        0.828066
min        4.300000
25%        5.100000
50%        5.800000
75%        6.400000
max        7.900000
Name: sepal_length, dtype: float64

In [49]:
irisFile['target'].describe()

count           150
unique            3
top       virginica
freq             50
Name: target, dtype: object

------------------------------------------------------------------------------------------------------------------
Selecting columns
There are three main methods of selecting columns in pandas:

1. using a dot notation, e.g. data.column_name,
2. using square braces and the name of the column as a string, e.g. data['column_name']
3. using numeric indexing and the iloc selector data.iloc[:, <column_number>]

* All these are series type of pandas

In [52]:
irisFile.target.head(5) #using . notation to fetch the records

0    setosa
1    setosa
2    setosa
3    setosa
4    setosa
Name: target, dtype: object

In [53]:
irisFile['sepal_length'].tail(5)

145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: sepal_length, dtype: float64

In [55]:
irisFile.iloc[:,2].head(5)

0    1.4
1    1.4
2    1.3
3    1.5
4    1.4
Name: petal-length, dtype: float64

Selecting Rows

1. numeric row selection using the iloc selector, e.g. data.iloc[0:10, :] – select the first 10 rows.
2. label-based row selection using the loc selector (this is only applicably if you have set an “index” on your dataframe. e.g. data.loc[44, :]
3. logical-based row selection using evaluated statements, e.g. data[data["Area"] == "Ireland"] – select the rows where Area value is ‘Ireland’.

In [66]:
irisFile.loc[2]

sepal_length       4.7
sepal_width        3.2
petal-length       1.3
petal width        0.2
target          setosa
Name: 2, dtype: object

In [68]:
irisFile.iloc[0:10,:]

   sepal_length  sepal_width  petal-length  petal width  target
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa
7           5.0          3.4           1.5          0.2  setosa
8           4.4          2.9           1.4          0.2  setosa
9           4.9          3.1           1.5          0.1  setosa

In [210]:
filter_iris=irisFile[irisFile['target']=='setosa']

### Agreegate Functions

In [211]:
filter_iris.count()

sepal_length    50
sepal_width     50
petal-length    50
petal width     50
target          50
dtype: int64

In [212]:
filter_iris.min()

sepal_length       4.3
sepal_width        2.3
petal-length         1
petal width        0.1
target          setosa
dtype: object

In [213]:
filter_iris.max()

sepal_length       5.8
sepal_width        4.4
petal-length       1.9
petal width        0.6
target          setosa
dtype: object

In [217]:
irisFile.groupby('sepal_length').agg()#needs to check on this

TypeError: f() takes 1 positional argument but 2 were given

### DataFrame from csv file -in Machine

In [82]:
import os

In [83]:
os.getcwd()

'C:\\Users\\Sanvi\\PythonPracticing_Vinod'

In [152]:
ctn_file = pd.read_csv("E:\Programming\Analytics\PythonDataSets\contacts_csv.csv")

In [153]:
ctn_file.shape

(132, 34)

<font color='blue'>  Drop of the columns whose null values are greater than 60% </font>

In [154]:
ctn_file.dropna(axis=1,how='all',thresh =ctn_file.shape[0]*0.6,inplace =True)

1. <font color='blue'> Drop the unwanted columns </font>
2. To delete rows and columns from DataFrames, Pandas uses the “drop” function.

In [155]:
ctn_file.head(5)

      First Name Last Name         Display Name Mobile Phone
0        Khanna.  Obireddy     Khanna. Obireddy          NaN
1          Manoj         P              Manoj P          NaN
2      Sadikshya      Pant       Sadikshya Pant          NaN
3     rajasekhar     reddy     rajasekhar reddy          NaN
4  vishnuvardhan     reddy  vishnuvardhan reddy          NaN

In [156]:
ctn_file=ctn_file.drop('Display Name',axis=1)

In [92]:
# Delete the records in row wise , If Mobile Phone is Null.Using Index

In [157]:
indexes = ctn_file[ctn_file['Mobile Phone']=='NaN'].index # This is not giving the exact result , May be NaN is not a String

In [158]:
condition=pd.isnull(ctn_file['Mobile Phone']) # This I need to research on this ,by passing a condition to Data frame to delete the records.

In [159]:
condition[15]=True

In [160]:
ctn2=ctn_file[condition] # We can delete the rows by passing a like series , not like data frame (i.e. Only one row with index)

In [161]:
ctn_file.dropna(how='any',axis=0,inplace=True) #this will give the correct result , It will remove all teh records which is having NaN

<font color=blue> Reneame The column names<font>
    
* Column renames are achieved easily in Pandas using the DataFrame rename function. The rename function is easy to use, and quite flexible. Rename columns in these two ways:

* Rename by mapping old names to new names using a dictionary, with form {“old_column_name”: “new_column_name”, …}
* Rename by providing a function to change the column names with. Functions are applied to every column name.

In [111]:
#Remove the space First Name and Add underscore inplace of space between Mobile number

In [162]:
ctn_file= ctn_file.rename(columns={'First Name':'First_Name'})

In [163]:
# Again, the inplace parameter will change the dataframe without assignment
ctn_file.rename(columns={'Mobile Phone':'MobilePhone',"Last Name":"Last_Name"},inplace=True)

### Change Type of the columns 

You have three main options for converting types in pandas:

to_numeric() - provides functionality to safely convert non-numeric types (e.g. strings) to a suitable numeric type. (See also to_datetime() and to_timedelta().)

astype() - convert (almost) any type to (almost) any other type (even if it's not necessarily sensible to do so). Also allows you to convert to categorial types (very useful).

infer_objects() - a utility method to convert object columns holding Python objects to a pandas type if possible.

In [177]:
ctn_file.dtypes

First_Name     object
Last_Name      object
MobilePhone     int64
dtype: object

### convert MobilePhone into a Number by using the astype function.

DataFrame.astype() method is used to cast a pandas object to a specified dtype. astype() function also provides the capability to convert any suitable existing column to categorical type.

DataFrame.astype() function comes very handy when we want to case a particular column data type to another data type. Not only that but we can also use a Python dictionary input to change more than one column type at once. The key label in dictionary is corresponding to the column name and the values label in the dictionary is corresponding to the new data types we want the columns to be of.

Passed a dictionary to astype() function  
df = df.astype({"Name":'category', "Age":'int64'})

In [176]:
ctn_file.MobilePhone=ctn_file.MobilePhone.astype('int64',inplace=True)    # ValueError: invalid literal for int() with base 10: '939-345-9094' or +91

In [ ]:
# Replace hifen in mobile number to empty by using replace function



Replace all NaN elements in column ‘A’, ‘B’, ‘C’, and ‘D’, with 0, 1, 2, and 3 respectively.

>>> values = {'A': 0, 'B': 1, 'C': 2, 'D': 3}
>>> df.fillna(value=values)
    A   B   C   D
0   0.0 2.0 2.0 0
1   3.0 4.0 2.0 1
2   0.0 1.0 2.0 5
3   0.0 3.0 2.0 4

In [168]:
ctn_file.MobilePhone=ctn_file.MobilePhone.replace(['+','+1','-'],'')

#DataFrame.replace(to_replace=None, value=None, inplace=False, limit=None, regex=False, method='pad')[source]
#Replace values given in to_replace with value.
# Here we can not use replace function directly we can use String function replace

In [169]:
ctn_file['MobilePhone']=ctn_file['MobilePhone'].str.replace('-','')

In [170]:
ctn_file.MobilePhone=ctn_file.MobilePhone.str.replace('+','')

In [ ]:
# Merging Two String columns into a Single column in Pandas
First_Name     object
Last_Name      object

In [183]:
ctn_file['First_Name'].str.cat(ctn_file['Last_Name'],sep =' ').head(2)

# 1. Using String concatination function

15    praju banglr
21    Triveni Usaa
Name: First_Name, dtype: object

In [190]:
# 2. Using Lambda Functions 
# This method generalizes to an arbitrary number of string columns by replacing df[[‘First’, ‘Last’]]
# with any column slice of your dataframe, e.g. df.iloc[:, 0:2].apply(lambda x: ‘ ‘.join(x), axis=1).
# before join() , that represent separation between two columns

ctn_file[['First_Name','Last_Name']].apply(lambda x:' '.join(x),axis =1).head(2)

15    praju banglr
21    Triveni Usaa
dtype: object

In [195]:
# 3. Using + Operator
ctn_file['First_Name'] + ctn_file['Last_Name']

15               prajubanglr
21               TriveniUsaa
23           SreelathaSchool
24              AswiniSchool
25                 TarunUSAA
27                 SwathiSis
29              BharathSvcet
30                AligiriSir
32                  JagguUpl
33                BhargavUpl
36              LingeshaUSAA
38              NagendraGate
39              AswiniSchool
40               SaheenSvcet
42                   Sirisis
45               LalithSvcet
46               NaveenSvcet
47              MaheshSchool
48          GowhithaPrasanth
51                 VishnuUpl
52               BhaskarRoom
53                 ShivaUSAA
54                VishnuAnna
56                  ShivaTcs
58                RamanaGate
59                  VijayUsa
61              SireeshaUsaa
62     Shiva(Vannappa)School
63                   RajuUpl
66               KishoreRoom
               ...
100              RajendraUpl
101                  GuruTcs
102              SudhakarBpl
104                 PawanAce
105                HarishUpl
106              PrasanthCse
107                UdaySvcet
109            ChanukyaSvcet
110           KarunakarMaama
111                 AshokUpl
112               UgandarUpl
113                 GangaUpl
114                 PawanUpl
115                JithuUSAA
116              DhanujBillu
117              PavitraUSAA
118              AmeeraSvcet
119               ManojSvcet
120                RaviSvcet
121             MujaferBasha
122             DiwakarSvcer
123             ZareenaSvcet
124               SubodSvcet
125             SravaniSvcer
126                YetiSvcet
127              NaveenSvcet
128               MohanSvcet
129             KishoreSvcet
130             GowthamSvcet
131             KishoreSvcet
Length: 86, dtype: object

In [198]:
ctn_file['FullName']=ctn_file[['First_Name','Last_Name']].apply(lambda x:' '.join(x),axis =1)

In [199]:
ctn_file.head(5)

   First_Name Last_Name   MobilePhone          FullName
15      praju    banglr    9393459094      praju banglr
21    Triveni      Usaa  917702865956      Triveni Usaa
23  Sreelatha    School  919652207635  Sreelatha School
24     Aswini    School  918095646392     Aswini School
25      Tarun      USAA  919985265568        Tarun USAA

In [206]:
#Reset the index and do not add the exisiting index to a DataFrame
#df.reset_index(drop=True) --If we don not mention drop =True , then we add the existing index column to a DataFrame as column
ctn_file.reset_index(drop =True,inplace =True)

In [208]:
# Exporting the DataFrame to a File
ctn_file.to_csv("E:\Programming\Analytics\PythonDataSets\contacts_csv2.csv")